---
kind: method
id: M:Autodesk.Revit.DB.Macros.DocumentEntryPoint.#ctor
source: html/e19310c9-e2b9-489e-99cc-4d377ef64396.htm
---
# Autodesk.Revit.DB.Macros.DocumentEntryPoint.#ctor Method

Initializes a new instance of the DocumentEntryPoint class

## Syntax (C#)
```csharp
public DocumentEntryPoint()
```